package o;

import java.nio.ByteBuffer;

/* renamed from: o.ou  reason: case insensitive filesystem */
/* loaded from: classes2.dex */
class C9404ou {
    static final long[] a;
    private static final double[] b;
    static final long[] c;

    static {
        long[] jArr = new long[634];
        long[] jArr2 = new long[634];
        ByteBuffer.wrap("¥ÎÔ;~>\u0091\u0088ÏB\u0089J]Î5ê\u0081\u0089\u0095Îz á²¡ëûB\u0019I\u001a\u001fÊfú\u0012\u009f\u009b`¦ý\u0000¸\u0097G\u00828Ð\u009e s^\u008c±c\u0082Å¨\u00906/Ý¼b÷\u0012´C»Õ+{\u009ak°ªUe;-Á\u0006\u009cÔê¾\u0089øñHD\n%n,v\u0096Í*\u0086WdÛÊ¼\u0080u'í>\u0012¼ë \u0092qè\u008d\u0097k\u0093D[\u00871X~£¸\u0015rhý®\u009eLæ\u001aÏ\u0003=\u001aEß\u008fÐÁb\u00060k«³Äñº\u0087¼\u0086\u0096à¶.))«¨<\u008cqÜÙº\u000bI%¯\u008eT\u0010(\u008e\u001boÛqé\u00142±¢J\u0089'1¬\u009f¯\u0005n«pþ\u0017Ç\u009aÆÊÖM=\u009d¹\u0081x}\u0085ðF\u0082\u0093ðëN§lX#8í&!ÑGn,\u0007(oª\u0082Ì¤Û\u0084yEÊ£\u007fÎ\u0012e\u0097\u0097<Ì_Á\u0096þý}\fÿw±ü¾¼ÜO\u009fªÏ=÷6\t±Ç\u0095\u0083\ru\u0003\u008c\u001dùzãÐÒDo%\u009bìÎb\u0083jÅwÂè\u0001û$EvÕó¢\u0002yíVÔ\u008a\u0098EA\u008c4VDÖ¾V\u0091ïAkÖ\fíì6k\u0011ÆË\u008f\u0094³¢\u0002ë\u001c?9¹à\u008a\u0083¥ãO\u0007èX\u00ad$\u008f\\\"É\u00917l6Ù\u0099\u0095¾µ\u0085GD\u008fÿû-âæ\u0099\u0015³ÿùù\u008dÐ\u001f\u00ad\u0090\u007fü;±D'\u0098ô\u009fûJÝ\u00951\u007f1Çú\u001d\u008a}>ï\u007f\u001cüR\u00ad\u001c\u008e«^ä;fØc²V6\u009dJ@\u0087>Ouâ\"Nh©\rãSZªâ\u0002ÓQ\\(1U\u009a\u0083\u0084\u0012Ù\u0099\u001eÕ\u0080\u0091¥\u0017\u008fÿf\u008aà¶Î]sÿ@-\u0098ã\u0080úh\u007f\u0088\u001c\u007f\u008e¡9\u0002\u009fj#\u009frÉ\u0087CGD¬\u0087Nûé\u0014\u0019\u0015×©\"\u009dq¬\u008f\u00ad¦ÉµÄÎ\u0017³\u0099\u0010|\"ö\u0001\u009d \u007fT\u009b+\u0099Á\u0002\u0084O\u0094àûÀ1C%cz\u00199ð=\u0093î¼X\u009f\u0088\u0096&|u5·cµ»°\u001b\u0092\u0083%<¢ê\u009c\"w#î\u008bË\u0092¡\u0095\u008avu\u0017_·Iúí\u0014\u0012]6å\u001cy¨Y\u0016ô\u0084\u008f1Ì\t7®XÒ²þ?\u000b\u0085\u0099ï\u0007ß½ÎÎg\u0000jÉ\u008bÖ¡A\u0000`B½®ÌI\u0091@xSmÚ\u007f[õ\u0090\u0096hH\u0088\u008f\u0099yz^\u0001-ª³\u007f×Øõ\u0081xÕ`_ÍÏ2áÖ\u0085\\;à¡\u007fÍ&¦³JØÉßÀoÐ`\u001d\u008eüW°\u008b\u0082<\u0012y]¶ÎW¢Ë\u0017\u0017µ$\u0081íË}ÜÝ¢m¢hþ]T\u0015\u000b\t\u000b\u0002\u009eúT\u008d&å¦áÆ¸é°p\u009f\u0010\u009aøg$\u001c\u008cÆÔÀ\u009b@v\u0091×üDøÂ\u0010\u00946MûV6ò\u0094¹Cáz+Ä\u0097\u009cóÊlì[Z½\u00840½\b'r1ìå<ìJ1N½\u0094\u000fF\u0013®^Ñ6¹\u0013\u0017\u0098\u0099ö\u0085\u0084çWÝ~Àt&å\u0090\u0096êo8H\u0098O´¼¥\u000b\u0006Z¾cáëÎMÇñmû\u008d3`ð\u009cöä½°\u00809,Ä4\u009dìÜ GwõAÅg\u0089ä,ªùI\u001b`¬]7Õ·\u009bb9×t\u0085Ë%\u0082:Ç\u0086¨Ó\u009e÷qd¼¨S\b\u0086µM½ëÒgÊ¨b¡-f\u0083\u0080Þ©=¤¼`¤a\u0016S\u008d\rëxÍy[èpQfV\u0080kÙqF2ßö \u0086ÏÍ\u0097¿\u0097óÈ¨\u0083Àý¯}ðúÒ¤±=\u001b]l\u009cÃ¦îÆ1\u001acÃô\u0090ªw½`üôñ´Õ\u0015¬¹;\u0099\u0017\u0011\u0005-\u008bóÅ¿\\ÕFxîð¶ï4\n\u0098\u0017*¬ä\u0095\u0080\u0086\u009f\u000ez¬\u000eºà¨FÒ\u0019W\u0012é\u0098ÒX\u0086\u009f¬×\u0091ÿ\u0083wT#Ì\u0006¶\u007fdU),¿\bä\u001f=jswîÊ\u008e\u0093\u0086b\u0088*õ>²8gû*5²\u008dÞÆ\u0081ùôÃ\u001f1\u008b<\u0011<8ùó~®\u000b\u0015\u008bG8p^Ù\u008dÚî\u0019\u0006\u008cv\u0087ø¨ÔÏ¤\u0017É©öÓ\n\u0003\u008d\u001d¼Ôt\u0087Ì\u0084pe+\u0084ÈÔßÒÆ?;¥û\n\u0017ÇwÏ\tÏyÌ\u009d¹UÂÌ\u0081¬\u001fâ\u0093Õ\u0099¿¢\u0017'Û8Ë\u0000/Ê\u009cñÒ\u0006ýÀ;ýD.F\u0088½0J\u009eJ\u009cì\u0015v>.ÅÝD'\u001aÓÍº÷T\u00950á\u0088Á(\u009a\u0094Ý>\u008cõx¹Á:\u0014\u008e02Öçñ\u0088\u0099±¼?\u008c¡\u0096õ`\u000f\u0015§·å¼²¸\u0012Û\u0011¥Þëßf\u0017\u0091Ö\u000fV\u0093k\u009fÎ»%É\u0095¸F\u0087Âiï;ûæX)³\u0004k\nú\u008f÷\u001a\u000fâÂæÜ³ôà\u0093Ûs \u0093àò\u0018¸ÒP\u0088¸\u008c\u0097Os\u0083rUs¯½#PdNêÏÛ¬l$}b¥\u0083\u0089KÃ\u0096Î]§r«\u009e´|\u0081õ\u0011OÖ\u0086a\u009b¢rU¢\u0086\u0013ý\u0001E\u0087u\u0085§\u0098üA\u0096éRçÑ\u007f;Qü£§ \u0082ï\u0085\u0013=æHÄ£«fX\r_ÚõÌ\u0096?î\u0010·Ñ³ÿ»Ïé\u0094åÆ\u001f\u009fÕañý\u000f\u009bÓÇÊºn|S\u0082Èù½i\n\u001bhc{\u009c\u0016a¦Q!>-Ã\u001bú\u000fåi\u008d¸óâø\u0093ÞÃñ&\u0098mÛ\\k:v·¾\u0089R3\u0086\t\u0014eî+¦Àg\u008bY\u007f\u0094ÛH8@·\u0017ïº\u0012\u001aFPäÝëè\u0096 ×å\u001e\u0015f\u0091^$\u0086ï2Í`µµ\u00ad¨ªÿ\u0080¸ã#\u0019\u0012Õ¿`æ\u008dõï«Å\u0097\u009c\u008f±sk\u0096¶ý\u0083³ÝÐF|d¼ä \u008a¢,\r¾ö\u000eä\u00adJ·\u0011.³\u0092\u009dØ\u009ddÕz`wD\u0087b_\u0005l|J\u008b©:öÆÇ\u009b]-Ó\u0089´xy\u00824y\u00846\u0010ËKñ`Ë¥C\u0094þ\u001eí¸þÎ\u0094z=¦©'>\u0081\u001cÌf\u0088)¸\u0087¡cÿ\u0080*4&¨É¼ÿ`4Á0Rü,?8Añ|g\u009d\u009b§\u0083)6íÀÅ\u0002\u0091có\u0084©1öC5¼ðeÓ}\u0099ê\u0001\u0096\u0016?¤.Àd\u0081û\u009bÏ\u008d9ð}¢z\u0082Ãp\u0088\u0096N\u0085\u008c\u0091º&U»â&ï¶(¯êêÚ°«£²Ûå\u0092È®kFOÉo·zÚ\u0006\u0017ã»ËåY\u0090\u0087\u009dÜª½\u008fWúTÂ©ê¶³-øéóTedßùw$p)~½\u008bûêvÆ\u0019ï6®úå\u0014w k\u0003Ú¹\u009eY\u0095\u0088\u0085Ä\u0088´\u0002÷ýuS\u009bªá\u0003µüÒ¨\u0081Õ\u0099D£|\u0007R¢\u0085\u007fÊæ-\u0084\u0093¥¦ß½\u009f¸å¸\u008eÐ\u0097\u00ad\u0007§\u001f&²\u0082^Ì$Èsx/¢ö\u007f-ú\u0090V;Ë´\u001eùy4kÊþ¡&·×\u0081\u0086¼\u009f$¸2æ°ô6Æíæ? ]1Cø©_Ï\u0088t}\u0094\u009biÛáµHÎ|ÂDRÚ\"\u009b\u0002\u001bòÕg\u0090«AÂ¢\u0097Å`ºk\t\u0019¥½¶¸é\u0005Ë`\u000fí$g#G>8\u0013\u00946Àv\f\u0086ã\u000b¹Dp\u0093\u008f¨\u009bÎç\u0095\u008c¸s\u0092ÂÂ\u0090½wóH;¹¹´ìÕð\u001aJ¨(â(\u000bl ÝR2\u008dY\u0007#\u0094\u008aS_°¯Hìy¬è7ÜÛ\u001b'\u0098\u0018\"D\u008a\bðø¿\u000f\u0015k¬\u008b-6îÒÚÅ×\u00adø\u0084ª\u0087\u0091w\u0086Ì»Rê\u0094ºê¨\u007fê'¥9é¥Ò\u009fä±\u008e\u0088d\u000e\u0083£îîù\u0015>\u0089¤\u008cêª·Z\u008e+Í°%Ue11¶\u0080\u008e\u0017U_>¿\u0011 ±\u009d*·\u000enÖÈÞ\u0004udÒ\n\u008bû\u0015\u0085\u0092¾\u0006\u008d.\u009cís{¶Ä\u0018=Ä(ÐZ¤u\u001eLõ3\u0004qM\u0092eß\u0099?âÆÐ{\u007f«¿\u008fÛx\u0084\u009a_\u0096ïsÒV¥À÷|\u0095¨cv'\u0098\u009a\u00ad»\u0012|S±~ÁYé×\u001bh\u009dÞq¯\u0092&q!b«\u0007\r¶°\ri»UÈÑä\\\u0010Ä*+;\u0005\u008e¹\u008az\u009a[\u0004ã²gí\u0019@ñÆ\u001cß\u0001è_\u0091.7£\u008ba1;º¼âÆ®9}\u008a©l\u001bwÙÇÜíSÇ\"U\u0088\u001cê\u0014T\\uuª$$\u0099is\u0092ÒÔ\u00ad-¿ÃÐw\u0087\u0084ì<\u0097ÚbJ´¦'K½ÐúÝaÏ±\u001e\u00adE9\u0094º\u0081Î³,KCüô¢B_÷^\u0014ü1ÊÒ÷õ5\u009a;>ý\u0087µò\u0083\u0000Ê\r\u009etÑ·\u0091à~HÆ\u0012\u0006%vX\u009dÚ÷\u0096\u0087®ÓîÅQ\u009a¾\u0014ÍDu;RÁm\u009a\u0000\u0095\u0092\u008a'ñÉ\u0000\u0080º÷,±\u0097\u001d PtÚ{î¼å\bd\u0092\u0011\u001aêì\u001eJ}¶\u0095a¥\u0093\u0092î\u008e\u0092\u001d]\u0007¸wª26¤´Iæ\u0095\u0094¾ÄMá[\u0090\u001d|÷:°¬Ù´$Ü5\t\\Ø\u000fá.\u0013BK´\u000e\u0013\u008c¼Ì\toP\u0088Ë¯ëÿ\u000bË$ªþÛæþÎ½íÕ¾\u0089p_A6´¥\u0097«Ìw\u0011\u0084aÎüÖ¿\u0094ÕåzB¼\u00867½\u0005¯liµ§Å¬G\u001bG\u0084#Ñ·\u0017Xâ\u0019e+\u0083\u0012n\u0097\u008dOß;£×\n=p£×\nÌÌÌÌÌÌÌÌ\u0080\u0000\u0000\u0000\u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000\u0000\u0000\u0000È\u0000\u0000\u0000\u0000\u0000\u0000\u0000ú\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u009c@\u0000\u0000\u0000\u0000\u0000\u0000ÃP\u0000\u0000\u0000\u0000\u0000\u0000ô$\u0000\u0000\u0000\u0000\u0000\u0000\u0098\u0096\u0080\u0000\u0000\u0000\u0000\u0000¾¼ \u0000\u0000\u0000\u0000\u0000îk(\u0000\u0000\u0000\u0000\u0000\u0095\u0002ù\u0000\u0000\u0000\u0000\u0000ºC·@\u0000\u0000\u0000\u0000èÔ¥\u0010\u0000\u0000\u0000\u0000\u0091\u0084ç*\u0000\u0000\u0000\u0000µæ ô\u0080\u0000\u0000\u0000ã_©1 \u0000\u0000\u0000\u008e\u001bÉ¿\u0004\u0000\u0000\u0000±¢¼.Å\u0000\u0000\u0000Þ\u000bk:v@\u0000\u0000\u008aÇ#\u0004\u0089è\u0000\u0000\u00adxëÅ¬b\u0000\u0000Ø×&·\u0017z\u0080\u0000\u0087\u0086x2n¬\u0090\u0000©h\u0016?\nW´\u0000ÓÂ\u001bÎÌí¡\u0000\u0084YQa@\u0014\u0084 ¥o¥¹\u0090\u0019¥ÈÎË\u008f'ô \u000f:\u0081?9xø\u0094\t\u0084¡\u008f\u0007×6¹\u000båÉòÉÍ\u0004gNÞüo|@E\u0081\"\u0096\u009dÅ\u00ad¨+pµ\u009dÅ7\u0019\u00126Lã\u0005ö\u0084ßVÃà\u001bÆ\u009a\u0013\u000b\u0096:l\u0011\\À\u0097Î{É\u0007\u0015³ð½Â\u001a»HÛ \u0096v\u0099Pµ\r\u0088ô¼\u0014?¤âPë1ë\u0019O\u008e\u001aå%ý\u0092ïÑ¸ÐÏ7¾·«Æ'\u0005\u0003\u0005\u00adå\u0096·°ÆCÇ\u0019\u008f~2Î{ê\\o³]¿\u0082\u001aäó\u008bà5/b¡\u009e0n\u008c!=\u009d¥\u0002ÞE¯)\u008d\u0005\u000eC\u0095ÖÚóðFQÔ{L\u0088Øv+ó$Í\u000f«\u000e\u0093¶ïî\u0000SÕÒ8¤«é\u0080h\u0085£cfëqðA§\f<@¦NlQÐÏKPÏâ\u0007e\u0082\u0081\u008f\u0012\u0081íD\u009f£!ò×\"h\u0095ÇËêo\u008cë\u0002»9þå\u000bp%Ãj\b\u009fO'&\u0017\u009a\"EÇ\"ðï\u009d\u0080ªÖøë\u00ad+\u0084àÕ\u008b\u009b\u0093L;3\f\u0085wÂx\u001fIÿÏ¦Õó\u0016'\u001c\u007fÃ\u0090\u008a\u0097íØqÏÚ:V½éN\u008eCÐÈìíc¢1ÔÄû'\u0094^E_$û\u001cø¹uÖ¶î9ä6çÓLd©È]D\u0090ä\u000f¾ê\u001d:Jµ\u001d\u0013®¤¤\u0088ÝâdX\u009aMÍ«\u0014\u008d~·`p \u008aì°Þe8\u008cÈ\u00ad¨Ý\u0015þ\u0086¯úÙ\u0012\u008a-¿\u0014-üÇ«¬¹.Ù9{ù\u0096×çz\u008f\u0087Ú÷û\u0086ð¬\u0099´èÚý¨¬×À\"#\u0011¼ÒØ\r°*«Ö+\u0083Ç\b\u008e\u001a«eÛ¤¸Ê±¡V?RÍæý^\t«Ï&\u0080°^ZÆ\u000bax Üuñw\u008e9ÖÉ\u0013\u0093mÕqÈLûXxIJÎ:_\u009d\u0017K-ÎÀä{Ä]\u001dùBq\u001d\u009aõtew\u0093\re\u0000\u0099h¿j»è_ ¿ÂïEjâvèï³«\u0016Å\u009b\u0014¢\u0095ÐJî;\u0080ìå»D]©Êa(\u001fê\u0015u\u0014<ùr&\u0092Mi,¦\u001bçX¶àÃwÏ¢á.ä\u0098ôUÃ\u008b\u0099z\u008eß\u0098µ\u009a7?ì²\u0097~ã\u0000Å\u000fçß=^\u009bÀöSá\u008b\u0086[!X\u0099ôl®gñé®Àq\u0087Ú\u0001îd\u001ap\u008dé\u0088A4þ\u0090\u0086X²ªQ\u0082>4§îÞÔåâÍÁÑê\u0096\u0085\u000f\u00adÀ\u0099#2\u009e¦S\u00990¿kÿEÏè\u007f|ïFÿ\u0016\u0081ñO®\u0015\u008c_n¢m£\u0099\u009aïwIË\t\f\u0080\u0001«U\u001cýËO \u0002\u0016*c\u009e\u009f\u0011Ä\u0001MÚ~ÆFÖ5\u0001¡Q\u001d÷Ø\u008bÂB\t¥e\u009açWYiF\u0007_Á¡-/Ã\u0097\u00897ò\tx{´}k\u0084\u0097EëMPÎc2½\u0017f ¥\u0001ûÿì]?¨ÎBzÿ\u0093ºGÉ\u0080é\u008cß¸¨Ù»á#ð\u0017æÓ\u0010*Ùlì\u001d\u0090Cê\u001aÇä\u0013\u0092´Tä¡yÝ\u0018wáj\u001dÉØT^\u0094\u008câR\u009e'4»\u001d°\u001açE±\u0001éäÜ!¡\u0017\u001dBd]\u0089\u0095\u0004®rI~º«úEÚ\u000eÛÞiÖø×P\u0092\u0092Ö\u0003\u0086[\u0086\u0092[\u009bÅÂ§òh6ò\u0082·2Ñï\u0002D¯#dÿ\u00835ajív\u001f\u001f¤\u0002¹Å¨Ó¦çÍ\u0003h7\u0013\b\u0090¡\u0080\"!\"kåZd *©k\u0006Þ°ýÈ5SÅÈ\u0096]=úB¨·:»ô\u008c\u009ci©r\u0084µx×Ã\u0084\u0013Ï%â×\rôe\u0018Âï[\u008cÑ\u0098¿/yÕ\u00998\u0002¾îûXJÿ\u0086\u0003îªº.]¿g\u0084\u0095*´\\ú\u0097 ²ºuat9=\u0088ßé\u0012¹ÑG\u008cë\u0017\u0091«´\"Ì¸\u0012î¶\u0016¡+\u007fæ\u0017ªã\u009cIv_ß\u009d\u0094\u008eA\u00adéûëÂ}±Ò\u0019dzæ³\u001cÞF\u009f½\u0099 _ã\u008aì#Ö\u0080\u0004;î\u00ad§,Ì \u0005JéÙ\u0010÷ÿ(\u0006\u009d¤\u0087ª\u009aÿy\u0004\"\u0086©\u0095A¿WE+(Óú\u0092/-\u0016uò\u0084|\u009b]|.\t·¥\u009bÂ4Û9\u008c%Ï\u0002²Â\u0012\u0007ï.\u0081a¯¹KDõ}¡º\u001b§\u009e\u00162ÜÊ(¢\u0091\u0085\u009b¿\u0093ü²Ë5ç\u0002¯x\u009dï¿\u0001°a\u00ad«Åk®Â\u001cz\u0019\u0016öÆ\u009ar£\u0098\u009f[\u009a< \u0087¦?c\u0099ÀË(©\u008fÏ<\u007fðýòÓóÃ\u000b\u009f\u0096\u009e·ÄxYçC¼Feµ\u0096pa\u0014ëWÿ\"ü\fyY\u0093\u0016ÿuÝ\u0087ËØ·Ü¿STé¾ÎåÓï(*$.\u0081\u008f¤uy\u001aV\u009d\u0010³\u008d\u0092×`ìDUàp÷\u008d9'Uj\u008cF\u009a¸C¸\u0095b¯XAfT¦º»Û.Q¿éÐij\u0088üó\u0017ò\"Aâ«</ÝîªÒZÖ\u000b;ÕjU\u0086ñ\u0085Ç\u0005ebutV§8Æ¾»\u0012ÑlÑ\u0006øni×\u0085Ç\u0082¤[E\u0002&³\u009c£Mr\u0016B°`\u0084Ì Î\u009bÓ\\x¥ÿ)\u0002BÈ3\u0096Î\u009fy¡i½ >AÇX\tÄ,hMÑù.\f57\u0082aE\u009b¼Ç¡B±|ËÂ«ù\u0089\u0093]ÛþóV÷ëø5Rþ\u0098\u0016Zó{!SÞ¾\u001bñ°Yé¨Öí¢î\u001cpd\u0013\f\u0094\u0085ÔÑÆ>\u008bç¹§J\u00067Î.áè\u0011\u001c\u0087ÅÁº\u0099\u0091\n±ÔÛ\u0099\u0014 µM^J\u0012\u007fYÈâ µÜ\u0097\u001f0:\u008d¤q©Þs~$±\r\u008e\u0014V\u0010]\u00adÝPñ\u0099k\u0094u\u0018\u008aR\u0096ÿã<É/¬ç<¿Ü\u000bû{Ø!\u000bïÓ\u000eúZ\u0087\u0014§uãé\\x¨ÙÑS\\ã³\u0096Ó\u0010E¨4\u001c |\u0083ê+\u0089 \u0091äM¤ä¶kh¶]`Î\u001dä\u0006Bãô¹\u0080Ò®\u0083éÎxó¡\u0007Z$äB\u00170ÉI0®\u001dR\u009cüû\u009b|Ù¤§D<\u009dA.\b\u0006è\u008a¥Ä\u0091y\u008a\b¢\u00adNõµ×ì\u008aËX¢\u0099\u0091¦óÖ¿\u0017e¿ö\u0010°ÌnÝ?ïó\u0094Üÿ\u008a\u0094\u008e\u0095ø=\n\u001f¶\u009cÙ»vLL§¤D\u000fêSß_Ñ\u008dU\u0013\u0092tk\u009bâøU,·\u0011\u0086\u0082Û¶jwäÕè#\u0092¤\u0005\u0015\u008f\u0005±\u0016;¦\u0083-²Ç\u001d[Ê\u0090#øßxä²½4,ö\u008b«\u008eï¶@\u009c\u001a®\u0096r«£ÐÃ Ú<\u000fV\u008cÄóè\u0088e\u0089\u0096\u0017û\u0018qª~ëû\u009dùÞ\u008dÕ\u001e¦ú\u0085xV1\u00853(\\\u0093k5Þ¦\u007fòs¸F\u0003VÐ\u001fï\u0010¦W\u0084,\u0082\u0013õjgö²\u009b¢\u0098òÅ\u0001ô_BË?/vBqw\u0013þ\u000eûSÓ\rÔ×\u009eÉ]\u0014cè¥\u0006Æ{´Y|âÎHø\u001a¡oÜ\u001b\u0081Ú\u009b\u0010¤åé\u00911(ÁÔÎ\u001fcõ}ròJ\u0001§<òÜÏ\u0097nA\b\u0086\u0017Ê\u0001½IÑJ§\u009d¼\u0082ì\u009cE\u009dQ\u0085+¢\u0093á«\u0082Ró;E¸Ú\u0016bç°\n\u0017ç\u0010\u009bû¡\u009c\f\u009d\u0090ja}E\u0001\u0087â´\u0084ùÜ\u0096AéÚá¦8S»ÒdQ\u008d\u0007ã4Uc~²°IÜ\u0001j¼^_Ü\\S\u0001Åku÷\u0089¹³á\u001bc)º¬( Ùb;ô)×2)\u000fºÊñ3\u0086\u007fY©Ô¾ÖÀ¨\u001f0\u0014Iî\u008cpÒ&ü\u0019\\j/\u008c\u0083X]\u008fÙÂ]·¤.tóÐ2õ%Í:\u00120Ä?²o\u0080DK^z§Ï\u0085 U^6\u0019QÃfÈjµÃ\u009f¦4@ú\u0085c4\u0087\u008fÁP\u009c\u0093^\u0000Ô¹ØÒÃ¸5\u0081\tèO\u0007ô¦BáLbbÈ\u0098çéÌÏ½}½¿!ä@\u0003¬Ý,îê]P\u0004\u0098\u0014x\u0095RzR\u0002ß\fËº§\u0018æ\u0083\u0096ÏýéPß $|\u0083ý\u0091Ò\u008bt\u0016ÍÒ~¶G.Q\u001c\u0081G\u001dãØùåc¡\u0098å\u008eg\u009c/^Dÿ\u008f".getBytes("ISO-8859-1")).asLongBuffer().get(jArr2, 0, 634);
        System.arraycopy(jArr2, 0, jArr, 0, 634);
        c = jArr;
        long[] jArr3 = new long[634];
        long[] jArr4 = new long[634];
        ByteBuffer.wrap("A\u009e£½58^-R\u0006L¬\u0082\u0086u¹sCïëÑ\u0094\t\u0093\u0010\u0014ëæÅù\u000bøÔ\u001a&àwwNö\u0089 °\u0098\u0095U\"´U´n_]U5°ë!\u0089÷4ª\u0083\u001d¥éìu\u0001Õ#äG²3É!%6n\u0099\u009eÀ»in\u0084\nÀ\u0006pêCÊ%\r8\u0004\u0006\u0092j^W(Æ\u0005\b7\u0004õìò÷\u0086JDÆ3h.z³îjûà!\u001dY`ê\u0005ºØ)do¹$\u0087)\u008e3½¥Ó¶ÔyøàV\u008fH¤\u0089\u0098w\u0018l3\u001aÍ«þ\u0094Þ\u0087\u009fðÀ\u008b\u007f\u001d\u000b\u0014\u0007ìð®^äMÙÉè,Ùö\u009daP¾1\u001c\b:\"\\Òm½c\nHªô\u0006\t,»ÌÚÕ±\b%»õ`\bÅ\u008e¥¯*ò¸\nöòN\u001aõ¯f\r´®áPÙ\u008d\u009fÈ\u0090íMå\u000fñ\u0007ºµ( \u001eSíI©brÈ%èè\u009c\u0013»\u000fzw±\u0091a\u008cTé¬Õ\u009dõ¹ïj$\u0017K\u0005s(kD\u00ad\u001dNãgùC\nì2\"\u009cA÷\u0093Í§?kCRuxÁ\u0011\u000f\u0083\n\u0013\u0089kxª©#Ì\u0098kÆVÕS,¿¾\u0086·ì\u008a¨{÷×\u00142óÖ©ÚõÌÙ?°ÌSÑ³@\u000f\u008f\u009cÿh#\u0010\b\t¹Â\u001f¡«Ô\n\f(2§\u008a\u0016É\f\u008f2?Ql®=§Ù\u007fg\u0092ã\u0099Í\u0011ÏßAw\u009c@@VC×\u0011Õ\u0083H(5êfk%rÚ2Ce\u0000\u0005îÏ\u0090¾Ô>@\u0007j\u0082ZwD¦è\u0004¢\u0091q\u0015\u0015Ð¢\u0005Ë6\rZ[DÊ\u0087>\u0003èXy\nþ\u0094\u0086Âbn\u0097M¾9¨rû\n=!-È\u0012\u008f|æf4¼\u009d\u000b\u0099\u001c\u001fÿÁëÄN\u0080£'ÿ²fµb Kñÿ\u009f\u0000bº¨ow?Ã`=´©ËU\u000f´8M!Ó~*S¡F`jH.ÚtDËüBmú\u0091\u0011UþûS\by5U«~º'ÊKÁU\u008b/4XÞ\u009e±ªíû\u0001o\u0016F^\u0015©yÁÊÜ\u000búÍ\u0089ì\u0019\u001eÉÎù\u0080ìg\u001ff{\u0082·á'\u0080ç@\u001aÑ²ì¸°\u0090\u0088\u0010\u0086\u001f§æÜ´ª\u0015g§\u0091à\u0093áÔ\u009aàÈ»,\\m$àXúé÷s\u0088n\u0018¯9¤uPj\u0089\u009em\u0084\u0006ÉRB\u0096\u0003Èå\b{¦Ó;\u0083û\u001eJ\u009a\u0090\u0088\nd\\òî \u009aU\u0006\u007fô/ªHÀêH\u001eñ;\u0094Úñ$Ú&vÅ=\bÖ·\bXTv\u008cK\fdÊn©\u0094/]Ï}ý\tÓù;5C]|LÄ{Å\u0001J\u001am¯5\u009a¶A\u009c¡\t\u001bÃ\u0001cÒ\u0003ÉKbyàÞcB]Ï\u001d\u0098Y\u0015ü\u0012õBä>o[{\u0017²\u0093\u009d§\u0005\u0099,îÏ\u009cBPÆÿx*\u0083\u0083S¤ø¿V5$d(\u0087\u001bw\u0095á6¾\u0099(âU{Y\u0084n?3\u001aêÚ/å\u0089Ï?ðÒÈ]ïv!\u000fí\u0007zukS©ÓèIY\u0012Æ(\u0094dq-×«»Ù\\½\u008dyM\u0096ªÏ³ìð× üU\u0083 ô\u0016\u0086Ä\u009dµrD1\u001c(uÅ\"ÎÕ}c2\u00936k\u0082\u008b®]ÿ\u009c\u0002\u00031\u0097Ùõ\u007f\u0083\u0002\u0083ýüÐrßcÃ$ý{BGË\u009eY÷\u001emRÙ¾\u0085ðtæ\bg\u0090.'l\u0092\u001f\u008b\u0000º\u001cØ£ÛS¶\u0080è¤\u000eÌÒ(¤a\"Í\u0012\u0080\u0006²Íyk\u0080W \b_\u0081Ëã06t\u0005;°¾ÛüD\u0011\u0006\u008a\u009cî\u0092ûU\u0015H-Du\u001bÝ\u0015-M\u001cJÒbÔZx c]\u0086û\u0089q\u0016È|4Ô]5æ®=M \u0089t\u0083`YÌ¡\t+Ñ¤8p?ÉK{c\u0006£F'ÝÏ\u001a;ÈL\u0017±ÕB Êº_\u001d\u009eJ\u0093T~´{r\u0082î\u009cé\u009ea\u009aO#ªCd\u0005ú\u0000âì\u0094ÔÞ\u0083¼@\u008dÓÝ\u0004\u0096$«P±HÔE;\u00adÖ$Ý\u009b\tWåL¥×\n\u0080åÖ^\u009fÏLÍ!\u001fLvGÃ \u0000ig\u001f)ìÙô\u0000Aàsôh\u0010q\u0000RX\u0090q\u0082\u0014\u008d@fî´ÆñLØH@U0¸\u00ad \u000eZPj|¦Ù\b\u0011ðä\u0085\u001c\u0090\u008fJ\u0016m\u001d¦c\u009aY\u008eN\u00042\u0087þ@ïñá\u0085?)ýÑ+îYæ\u008eô|\u0082»tø0\u0019XÎãjR6<\u001f¯\u0001ÜDæÃË'\u009aÁ)«\u0010:^øÀ¹t\u0015ÔHö¶ðç\u0011\u001bI[4d\u00ad!Ê±\rÙ\u0000¾ì4=]QO@î§B\f´¥£\u0011*Q\u0012Gðç\u0085êºr«Yí!gei\u000fV0hiÁ>ÃS,\u001eAB\u0018Ç:\u0013ûåÑ\u0092\u009eù\b\u0098úßE÷F·J¿9k\u008bº\u008c2\u008e·\u0083\u0006n©/?2edÈ\nS{\u000eþþ½½\u0006t,é__6,H\u00118#·7\u0004÷Z\u0015\u0086,¥\u0004Å\u009a\u0098MsÛç\"ûÁ>`ÐÒàëº1\u008dù\u0005\u0007\u0099&¨ýñwFI\u007fpRþ¶ê\u008bíï¦3þd¥.ék\u008fÀ=ýÎz£Æs°\u0006¾¡\f¦\\\bNHnIOÏó\nbZ\u0089Û£ÃïÌúø\u0096)FZuà\u001cö»³\u0097ñ\u0013X#tj }íX.,¨Â¤N´W\u001cÜ\u0092óMbalä\u0013w° ºùÈ\u001d\u0017\nÎ\u0014tÜ\u001d\u0012.\r\u0081\u0099\u0092\u0013$Vº\u0010áÿö\u0097íliÊ\u008d?ú\u001eôcÁ½0\u008fø¦±|²¬|³öÐ]ÛÞkÍðzB:©k\u0086Ál\u0098ÒÉSÆèqÇ¿\u0007{¨·\u0011G\u001c×d\u00adIrÕ\u0098ä\r=Ø\u009bÏJÿ\u001d\u0010\u008dNÂÃÎßr*XQ9ºÂ\u0097N´îe\u0088(s=\"b)þê2\b\u00065}Z?R_Ê\u0007ÂÜ°Ï&÷ü\u0089³\u0093Ý\u0002ðµ»¬ xÔC¬âÕK\u0094K\u0084ªL\r\n\u009ey^eÔß\u0011MF\u0017µÿJ\u0016ÕPKÎÑ¿\u008eNEä^Â\u0086/qáÖ]vs'»NZL:j\u0007øÕ\u0010øo\u0089\u0004\u0089÷\nU6\u008b+E¬tÌê\u0084.;\u000b\u008bÉ\u0000\u0012\u0092\u009d\tÎn»@\u00177DÌB\nj\u0010\u001d\u0005\u0015\u009f©F\u0082J\u0012#-G\u0093\u0098\"Ü\u0096«ùYx~+\u0093¼V÷WëNÛ<U¶Zíæ\"\u0092\u000bk#ñé_«6\u008eEìí\u0011ÛË\u0002\u0018ë´\u0014ÖR½Â\u009f&¡\u0019Kçm3FðI_op¤@\fV-ÛËLÍP\u000fk¹R~ \u0000¤\u0013F§§\u008eÔ\u0000f\u008c\f(Èr\u0089\u0000\u0080/\u000f2úO+@ :Òÿ¹âö\u0010ÈI\u0087¿¨\rÙÊ}-ô×É\u0091P=\u001cyr\r»u¤Lc\u0097Î\u0091*É\u0086¯¾>á\u001aºûè[\u00adÎ\u0099ahúâr\u0099B?¹ÃÜÍ\u0087\u009fÉgÔ\u001aT\u0000é\u0087»ÁÉ )\u0001#éª²;hù ¶r\n¯e!ø\bä\u000e\u008d[>i¶\u000b\u001d\u00120²\u000e\u0004±Æò+^oHÂ\u001e8®¶6\u000b\u001aó%ÆÚcÃ\u008dá°W\u009cH~Z8\u00ad\u000e-\u0083Z\u009dðÆØQøä1Elø\u008ee\u001b\u008e\u009eËd\u001bXÿârF~=\"/?[\u000eØ\u001dÌj»\u000f\u0098éG\u0012\u009fÂ´é?#\u0098×G³b$\u008eì\u007f\r\u0019 :\u00ad\u0019SÏh0\u0004$¬_¨ÃB<\u0005-×7\u0092ô\u0012Ë\u0006yMâ»Ø\u008b¾ä\u000bÐ[jÎ®®\u009d\u000eÄòE\u0082ZZDRuîÖâððÕg\u0012UFMÖ\u0096\u0085`kª\u0097áL<&¸\u0086Õ=Ù\u009fK0f¨åF¨\u0003\u008eþ@)Þ\u0098R\u0004r½Ð3\u0096>f\u0085\u008fmD@Ýç\u0000\u0013y¤J¨U`À\u0018X\r]Rª¸ð\u001en\u0010´¦Ê³\u0096\u0013\u0004Êpè=`{\u0097Åý\r\"\u008c¸\u009a}·|Pjwó`\u008e\u0092\u00ad²BUð8²7Y\u001eÓklFÞÅ/f\u0088##¬K;= \u0015«ì\u0097^\n\r\b\u001a\u0096ç½5\u008c\u0090J!~PÖAwÚ.TÝå\u000bÑÕÐ¹é\u0095^NÆKDèd½Zñ;ï\u000b\u0011>ì±\u00ad\u008aêÍÕ\u008egÞ\u0018í¥\u0081Jò\u0080êÏ\u0094\u0087pÎ×¡%\u0083y©M\u0002\u008d\tnäX\u0013 C0\u008bÊ\u009dn\u0018\u0088Süw^¢dÏU4}\u00956Jþ\u0003*\u0081\u009d:\u0083Ý½\u0083õ\"\u0004Ä\u0092j\u0096ry5Bu·\u0005<\u000f\u0017\u0082\u0093S$Æ\u008b\u0012Ýc8Óöü\u0016ëÊ^\u0003\u0088ô»\u001c¦¼õ\u0084+1éãÐl2å:ÿ2.bC\u009fÏ\t¾þ¹úÔ\u0087ÂL.¾hy\u0089©³\u000f\u009d7\u0001Kö\n\u0010S\u0084\u0084Á\u009eó\u008c\u0094(e¥ò\u0006°o¹ù?\u0087·D.EÓ÷\u008fi¥\u00159×HµsD\u000eZ\u0088M\u001b1h\n\u0088ø\u009500ýÂ\r+6º|==2\u0090v\u0004i\u001bL¦?\u009aIÂÁ±\u000f\u000fÏ\u0080Ü3r\u001dSÓÃa\u0013@N¤¨dZ\u001c¬\b1&é=p£×\n=p£ÌÌÌÌÌÌÌÌ\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u0000\u0000\u0000\u0000\u0000\u0000\u0000P\u0000\u0000\u0000\u0000\u0000\u0000\u0000¤\u0000\u0000\u0000\u0000\u0000\u0000\u0000M\u0000\u0000\u0000\u0000\u0000\u0000\u0000ð \u0000\u0000\u0000\u0000\u0000\u0000l(\u0000\u0000\u0000\u0000\u0000\u0000Ç2\u0000\u0000\u0000\u0000\u0000\u0000<\u007f@\u0000\u0000\u0000\u0000\u0000K\u009f\u0010\u0000\u0000\u0000\u0000\u0000\u001e\u0086Ô\u0000\u0000\u0000\u0000\u0000\u0013\u0014D\u0080\u0000\u0000\u0000\u0000\u0017ÙU \u0000\u0000\u0000\u0000]Ï«\b\u0000\u0000\u0000\u0000Z¡Êå\u0000\u0000\u0000\u0000ñJ=\u009e@\u0000\u0000\u0000m\u009cÍ\u0005Ð\u0000\u0000\u0000ä\u0082\u0000#¢\u0000\u0000\u0000Ý¢\u0080,\u008a\u0080\u0000\u0000Õ\u000b 7\u00ad \u0000\u0000E&ô\"Ì4\u0000\u0000\u0096p±+\u007fA\u0000\u0000<\fÝv_\u0011@\u0000¥\u0088\niûjÈ\u0000\u008eê\r\u0004zEz\u0000r¤\u0090E\u0098ÖØ\u0080G¦Ú+\u007f\u0086GP\u0099\u0090\u0090¶_gÙ$ÿô´ã÷AÏm¿øñ\u000ez\u0089!¤¯÷-R\u0019+j\r\u009bôø¦\u009fvD\u0090\u0002ò6ÐGSÕ´\u0001×bB,\u0094e\u0090BM:Ò·¹~õÒà\u0089\u0087e§Þ²cÌUô\u009f\u0088ë/<¿kqÇk%û\u008bïFN9Eïz\u0097u\u008bðãËµ¬=Rîí\u001c¾£\u0017L§ª¨cîKÝ\u008fèÊ©>tïj³âýS\u008e\u0012+D`Û¼¨q\u0096¶\u0016¼\u0089UéFþ1Ík««c\u0098½¾AÆ\u0096\u0096<~í-Ñü\u001e\u001dåÏT<¢;%¥_C)KËIï\u000e·\u0013ó\u009e¾n5i2lxC7IÂÃ\u007f\u0007\u0096T\u0004Ü3t^É{é\u0006i (»=íq£Ä\b2ê\rhÎ\fõ\n?¤\u0090Ã\u0001\u0090y&gÆÚyàúWp\u0001¸\u0091\u0018Y8íL\u0002&µ^o\u0086TO\u0081X1[\u0005´ica®=±Ç!\u0003¼:\u0019Í\u001e8é\u0004«H @eÇ#bë\rd(?\u009cv;¥Ð½2O\u0083\u0094Ê\u008fDì~ãdy~\u0099\u008b\u0013ÏN\u001eË\u009e?íØÃ!¦~ÅÏéNóê\u0010\u001e»¡ñÑXrJ\u0012*\u008anE®\u008eÜ\u0097õ-\t×\u001a2\u0093½Y<&&p_\u009cVo\u008b/°\fw\u0083l\u000bmû\u009c\u000f\u0095dGG$½A\u0089½^¬Xíì\u0091ì,¶W/)g¶g7ãí½yàÒ\u0000\u0082îtìØY\u0006\u0080£ª\u0011è\u000eoH Ì\u0094\u00951\t\u0005\u008d\u0014\u007fÜÝ½KFðY\u009fÔ\u0015l\u009e\u0018¬p\u0007É\u001a\u0003âÏkÆ\u0004Ý°\u0084Û\u0083F·\u0086\u0015\u001cæ\u0012d\u0018eg\u009acOË~\u008f?`À~ã¾^3\u000f8ð\u009d\\\u00adõ¿Ó\u0007,ÅsÙs/ÇÈ÷ö(gçýÜÝ\u009aú²\u0081áýT\u0015\u0001¸\u001f\"Z|©\u001aB&3ux\u008dé°iX\u0000RÖ±d\u001c\u0083®Àg\u008c]½#¤\u009aø@·º\u00966Fà¶På©;ÃØ\u0098£å\u001f\u0013\u008a´Î¾Æo3l6±\u00017¸\u000b\u0000GD]A\u0084¦\rÀY\u0015t\u0091å\u0087È\u00987\u00adhÛ/)º¾E\u0098Ã\u0011ûô)mÖþóÖz\u0018\u0099ä¦_Xf\f^À]Ï÷.\u007f\u008fvpuCôú\u001fsj\u0006IJy\u001cS¨\u0004\u0087Û\u009d\u0017ch\u0092E©Ò\u0084]<B¶\u000b\u008a#\u0092ºE©²\u008el¬wh×\u0014\u001e2\u0007×\u0095C\fÙ&\u007fDæ½Iè\u0007¸_\u0016 l\u009cb\t¦6Û¨\u0087Ãz\u008c\u000fÂIITÚ,\u0097\u0089òÛ\u009bª\u0010·½lo\u0092\u0082\u0094\u0094å¬ÇËw#9º\u001f\u0017ùÿ*v\u0004\u0014Snûþõ\u0013\u0085\u0019hJº~²Xf_Â]iï/w?ûÙzaªûU\u000fúÏØú\u0095º*Sù\u0083Ï8Ý\u0094Zt{òa\u0083\u0094ùq\u0011\u009aîùäz7ÍV\u0001ª¸]¬bàUÁ\n³:W{\u0098k1M`\tíZ~\u0085ý ¸\u000b\u0014X\u008f\u0013¾\u0084s\u0007Yn²Ø®%\u008fÈoÊ_\u008eÙ®ó»%Þ{¹H\rXT¯V\u001a§\u009a\u0010®j\u001b+¡Q\u0080\u0094Ú\u0004\u0090ûDÒð]\bB5:\u0016\u0007¬tJSB\u0088\u009b\u0089\u0097\u0091\\èi\u0095a5þºÚ\u0011Cú¹\u0083~i\u0090\u0095\u0094ùgä^\u0003ô»\u001d\u001bàîºÂxõdbÙ*is\u00172}{\u008fu\u0003ÏÜþ\\ÚsRDÃÔ>:\b\u0088\u0013júd§\b\u008aª\u0018E¸ýÐ\u008a\u00adT\u009eW'=E6¬Tâöx\u0086K\u0084Wj\u001b´\u0016§ÝemD¢¡\u001cQÕ\u009fdJå¤±³%\u0087=]\u009f\rÞ\u001fî©\fµ\u0006ÑU§ê\t§ñ$BÕ\u0088ò\f\u0011ímS\u008aë/\u008f\u0016hÈ¨m¥úùn\u0001}iD\u0087¼7É\u0081ÜÃ\u0095©¬\u0085»âSô{\u0014\u0017\u0093\u0095mtxÌì\u008e8zÈÑ\u0097\u0000'²\u0006\u0099{\u0005üÀ1\u009eD\u001fìã½ø\u001f\u0003Õ'è\u001c\u00adv&Ã\u008aqâ#ØÓ°tö\u0087-Vg\u0084NI´(ø¬\u0001eaÛá36×\u0001¾ºRìÀ\u0002Fa\u00174s'ð\u0002×ù]\u0001\u00901ì\u0003\u008d÷´Aô~g\u0004qu¡Rq\u000f\u0000bÆé\u0084Ó\u0086RÀ{x£æ\bh§p\u009aVÌß\u008a\u0082\u0088¦`v@\u000b¶\u0091jÏø\u0093Ð\u000e¤5\u0005\u0083ö¸Ä\u0012MCÃrz3z\u008bpJtO\u0018ÀY.L\\\u0011bÞðoyßs\u008aÝËVE¬+¨m\u0095>+×\u00176\u0092Èú\u008d¶ÌÝ\u00047\u001d\u009c\u0098\u0092@\n\"¢%\u0003¾¶Ð\f«K.D®d\u0084\u000fÖ\u001d\\êìþÒ\u0089åÒt%¨>\u0087,_GÑ/\u0012N(÷w\u0019\u0082½kpÙ\u009aªoclÆM\u0010\u0001U\u000b<G÷àT\u0001ªNe¬úì4\u0081\nq\u007f\u00189§A¡M\r\u001eÞH\u0011\u0012\t P\u0093Jí\n«F\u00042ø\u001d¨MV\u0017\u0085?6%\u0012`«\u009df\u008eÁ×+|kB`\u0019²Lö[\u0086\u0012ø\u001fÞà3òg\u0097¶'\u0016\u0098@ï\u0001}£±\u008e\u001f(\u0095`î\u0086Nñ¦òº¹*'â®\u0010¯igt±Û¬Êm¡à¨ï)\u0017ý\t\nXÓ*óÝüKLï\u0007õ°J½¯\u0010\u0015dù\u008e\u009dm\u001aÔ\u001a¾7ñ\u0084Èa\u0089!mÅí2ý<õ´ä\u009b´?¼\u008c3\"\u001dÂ¡\u000f«¯?ê¥3J)ËM\u0087ò§@\u000et> éïQ\u0010\u0012\u0091M©$k%T\u0016\u001aÐ\u0089¶Â÷T\u008e¡\u0084¬$sµ)±Éå×-\u0090¢t\u001e~/¦|ze\u0088\u0092Ý»\u0090\u001b\u0098þê·U*t\"\u007f>¥eÕ:\u0088\u0095\u008f\u0087'_\u008a\u0089*ºóhñ7-+ui°C-\u0085\u009c;)b\u000e)üs\u0083Ióº\u0091´{\u008f$\u001cp©6!\u009así#\u008cÓ\u0083ª\u0001\u0010ô68\u00042J@ª±CÆ\u0005>ÜÐÕÝ\u0094·\u0086\u008e\u0094\u0005\nÊ|ò´\u0019\u001c\u0083&ý\u001c/a\u001fc£ð¼c;9g<\u008cìÕ¾\u0005\u0003à\u0085Ø\u0013K-\u0086DØ§N\u0018ÝøçÖ\u000eÑ!\u009eÊ»\u0090åÉBµ\u0003=ju\u001f;\u0093bC\fÅ\u0012g\nx:Ô'û+\u0080f\u008b$Å±ùö`\u0080-íö^xsø 9isÛ\u000bH{d#áè\u0091Î\u001a\u009a=,ÚbvA¡@Ìx\u0010û©é\u0004È\u007fË\n\u009dTcEú\u009f½ÍD©|\u0017yG\u00ad@\u0095Ií\u008e«ÌÌH]\\hòV¿ÿZts\u0083.ìoÿ1\u0011È1ýSÅÿ~«º>|¨·\u007f^U(Î\u001bÒå_5ëy\u0080ÑcÏ[\u0081³×á\u0005¼Ã2b\u001f\u008dÙG+óþú§±O\u0098öðþ¹QnÑ¿\u009aV\u009f3Ó\n\u0086/\u0080ìG\u0000ÈÍ'»a'XÀú\u00808Õ\u001c¸\u0097x\u009càG\ncæ½VÃ\u0018XÌüàl¬t\u000f7\u0080\u001e\fCëÈÓ\u0005`%\u008fTæºGÆ¸.ó* iLÜ3\u001dWúTAà\u0013?ä\u00adøéRX\u0018\u000fÝÙw#¦W\u000f\tê§êvH".getBytes("ISO-8859-1")).asLongBuffer().get(jArr4, 0, 634);
        System.arraycopy(jArr4, 0, jArr3, 0, 634);
        a = jArr3;
        b = new double[]{1.0d, 10.0d, 100.0d, 1000.0d, 10000.0d, 100000.0d, 1000000.0d, 1.0E7d, 1.0E8d, 1.0E9d, 1.0E10d, 1.0E11d, 1.0E12d, 1.0E13d, 1.0E14d, 1.0E15d, 1.0E16d, 1.0E17d, 1.0E18d, 1.0E19d, 1.0E20d, 1.0E21d, 1.0E22d};
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    public static a c(long j, long j2) {
        long j3 = j & 4294967295L;
        long j4 = j >>> 32;
        long j5 = j2 & 4294967295L;
        long j6 = j2 >>> 32;
        long j7 = j6 * j3;
        long j8 = j3 * j5;
        long j9 = (j5 * j4) + (j8 >>> 32) + (j7 & 4294967295L);
        return new a((j4 * j6) + (j9 >>> 32) + (j7 >>> 32), (j9 << 32) | (4294967295L & j8));
    }

    static double b(boolean z, long j, int i) {
        int compare;
        int compare2;
        int compare3;
        int compare4;
        double d;
        if (-22 <= i && i <= 22) {
            compare4 = Long.compare(j ^ Long.MIN_VALUE, 9007199254740991L ^ Long.MIN_VALUE);
            if (compare4 <= 0) {
                double d2 = j;
                if (i < 0) {
                    d = d2 / b[-i];
                } else {
                    d = d2 * b[i];
                }
                return z ? -d : d;
            }
        }
        int i2 = i + 325;
        long j2 = c[i2];
        long j3 = i;
        int numberOfLeadingZeros = Long.numberOfLeadingZeros(j);
        long j4 = j << numberOfLeadingZeros;
        a c2 = c(j4, j2);
        long j5 = c2.a;
        long j6 = c2.b;
        if ((j6 & 511) == 511) {
            compare = Long.compare((j5 + j4) ^ Long.MIN_VALUE, j5 ^ Long.MIN_VALUE);
            if (compare < 0) {
                a c3 = c(j4, a[i2]);
                long j7 = c3.a;
                long j8 = c3.b + j5;
                compare2 = Long.compare(j8 ^ Long.MIN_VALUE, j5 ^ Long.MIN_VALUE);
                if (compare2 < 0) {
                    j6++;
                }
                if (j8 + 1 == 0 && (j6 & 511) == 511) {
                    compare3 = Long.compare(j4 ^ Long.MIN_VALUE, j7 ^ Long.MIN_VALUE);
                    if (j7 + compare3 < 0) {
                        return Double.NaN;
                    }
                }
            }
        }
        long j9 = j6 >>> 63;
        long j10 = j6 >>> ((int) (9 + j9));
        int i3 = numberOfLeadingZeros + ((int) (j9 ^ 1));
        long j11 = j6 & 511;
        if (j11 != 511 && (j11 != 0 || (3 & j10) != 1)) {
            long j12 = (j10 + 1) >>> 1;
            if (j12 >= 9007199254740992L) {
                i3--;
                j12 = 4503599627370496L;
            }
            long j13 = (((j3 * 217706) >> 16) + 1087) - i3;
            if (j13 >= 1 && j13 <= 2046) {
                return Double.longBitsToDouble(((-4503599627370497L) & j12) | (j13 << 52) | (z ? Long.MIN_VALUE : 0L));
            }
        }
        return Double.NaN;
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    public static double e(boolean z, long j, int i, boolean z2, int i2) {
        if (j == 0) {
            return 0.0d;
        }
        if (z2) {
            if (-325 <= i2 && i2 <= 308) {
                double b2 = b(z, j, i2);
                double b3 = b(z, j + 1, i2);
                if (!Double.isNaN(b2) && b3 == b2) {
                    return b2;
                }
            }
        } else if (-325 <= i && i <= 308) {
            return b(z, j, i);
        }
        return Double.NaN;
    }

    static double d(boolean z, long j, int i) {
        int compare;
        compare = Long.compare(j ^ Long.MIN_VALUE, 9007199254740991L ^ Long.MIN_VALUE);
        if (compare <= 0) {
            double scalb = j * Math.scalb(1.0d, i);
            return z ? -scalb : scalb;
        }
        return Double.NaN;
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    public static double c(boolean z, long j, long j2, boolean z2, long j3) {
        if (j == 0) {
            return 0.0d;
        }
        if (z2) {
            if (-1022 <= j3 && j3 <= 1023) {
                int i = (int) j3;
                double d = d(z, j, i);
                double d2 = d(z, j + 1, i);
                if (!Double.isNaN(d) && d2 == d) {
                    return d;
                }
            }
        } else if (-1022 <= j2 && j2 <= 1023) {
            return d(z, j, (int) j2);
        }
        return Double.NaN;
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    /* renamed from: o.ou$a */
    /* loaded from: classes2.dex */
    public static class a {
        final long a;
        final long b;

        private a(long j, long j2) {
            this.b = j;
            this.a = j2;
        }
    }
}
